# Regiment

### Introduction:

Special thanks to: http://chrisalbon.com/ for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

### Step 2. Create the DataFrame with the following values:

In [3]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

### Step 3. Assign it to a variable called regiment.
#### Don't forget to name each column

In [6]:
df = pd.DataFrame(raw_data)
df.head()

     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
4    Dragoons     1st     Cooze             3             70

### Step 4. What is the mean preTestScore from the regiment Nighthawks?

In [8]:
df[df['regiment'] == 'Nighthawks']['postTestScore'].mean()

59.5

### Step 5. Present general statistics by company

In [9]:
df.groupby('company').describe(include="all")

        regiment                                                        ...  \
           count unique         top freq mean  std  min  25%  50%  75%  ...
company                                                                 ...
1st            6      3  Nighthawks    2  NaN  NaN  NaN  NaN  NaN  NaN  ...
2nd            6      3  Nighthawks    2  NaN  NaN  NaN  NaN  NaN  NaN  ...

        postTestScore                                                          \
               unique top freq       mean        std   min    25%   50%   75%
company
1st               NaN NaN  NaN  57.666667  27.485754  25.0  34.25  66.0  70.0
2nd               NaN NaN  NaN  67.000000  14.057027  57.0  58.25  62.0  68.0


          max
company
1st      94.0
2nd      94.0

[2 rows x 44 columns]

### Step 6. What is the mean of each company's preTestScore?

In [10]:
df.groupby('company').postTestScore.mean()

company
1st    57.666667
2nd    67.000000
Name: postTestScore, dtype: float64

### Step 7. Present the mean preTestScores grouped by regiment and company

In [11]:
df.groupby(['regiment','company']).postTestScore.mean()

regiment    company
Dragoons    1st        47.5
            2nd        75.5
Nighthawks  1st        59.5
            2nd        59.5
Scouts      1st        66.0
            2nd        66.0
Name: postTestScore, dtype: float64

### Step 8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [12]:
df.groupby(['regiment','company']).postTestScore.mean() .reset_index()

     regiment company  postTestScore
0    Dragoons     1st           47.5
1    Dragoons     2nd           75.5
2  Nighthawks     1st           59.5
3  Nighthawks     2nd           59.5
4      Scouts     1st           66.0
5      Scouts     2nd           66.0

### Step 9. Group the entire dataframe by regiment and company

In [13]:
df.groupby(['regiment','company'])

### Step 10. What is the number of observations in each regiment and company

### Step 11. Iterate over a group and print the name and the whole data from the regiment